Repository: sugar-activities/4621-activity
Catalog: po/*.po
Languages: es

source: Butia Firmware
es: Butiá Firmware

source: Firmware hex not found
es: No se encontró el hex

source: Current firmware hex: %s
es: Hex de firmware actual: %s

source: Current firmware version: %s
es: Versión actual del firmware: %s

source: Butia Firmware Upgrader
es: Actualizador del Firmware Butiá

source: Check version
es: Verificar versión

source: Burn Firmware
es: Grabar Firmware

source: You will upgrade to the USB4Butia v%s firmware.
es: Vas a actualizar el firmware de la USB4Butiá a v%s.

source: Not disconnect the board and not close this activity.
es: No desconectes la placa y no cierres la actividad.

source: You want to continue?
es: ¿Deseas continuar?

source: Burning USB4Butia board...
es: Grabando la placa USB4Butiá...

source: Error reading Firmware version. Try again or test USB connection...
es: Error leyendo la versión del Firmware. Intenta nuevamente o verifica la conexión USB...

source: The current version of the Firmware is %s
es: La versión actual del Firmware es %s

source: USB4Butia firmware version...
es: Versión del firmware de la USB4Butiá...

source: Burning...
es: Grabando...

source: The upgrade ends successfully! The process takes %s seconds
es: ¡El proceso de actualización terminó exitosamente! El proceso tardó %s segundos

source: The upgrade fails. Try again. Error: %s
es: La actualización falló. Intente nuevamente. Error: %s
